#include <stdio.h>
/*
* 변수 : 하나의 값을 저장하는 메모리 공간 
* 1. 선언 + 초기화 -> int num = 4;
* 2. 선언, 초기화 -> int num; num = 4;
*
* 초기화?
* - 변수가 할당 된 실제 메모리 공간에는
*   기존에 파일들(쓰레기파일)이 남아있음
*   초기화를 통해서 쓰레기값을 삭제하고 값을 저장
*
* "=" : 대입연산자
* - 좌측과 우측의 값이 같다(X)
* - 우측의 값을 좌측에 대입한다(O)
*
* 변수와 상수
* - 변수 : 변할 수 있는 값(한번 생성후에 값을 여러번 변경)
* - 상수 : 변할 수 없는 값(한번 생성후에 값을 변경할 수 없음)
* + ex) 금리, 파이값
* + "const" 키워드를 사용하여 상수를 선언
* + 상수는 보통 대문자를 사용하여 선언(변수는 소문자 사용)
* + 상수는 "선언+초기화"만 가능
*
* 자료형(Data Type)
* - 해당 변수에 저장할 값의 형태를 작성
* - int, float, double, char, array, ...
*/
int main(){
    int a; // int형 변수 a 선언
    int b,c; // int형 변수 b,c 선언
    double da; // double형 변수 da 선언
    char ch; // char형 변수 ch 선언

    a = 10; // a 변수에 10 초기화
    da = 3.14; // da 변수에 3.14 초기화
    ch = 'A'; // ch 변수에 'A' 초기화
}